src/cf/InformationRegisters/НастройкиБлоковНавигации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>НастройкиБлоковНавигации</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗначениеНастройки</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПредставлениеНастройки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>БлокНавигации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БлокиНавигации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/НастройкиБлоковНавигации/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает значение настройки блока навигации для указанного пользователя.
//
// Параметры:
//  Пользователь  - СправочникСсылка.Пользователи         - Пользователь.
//  БлокНавигации - Справочники.БлокиНавигации - Блок навигации.
// 
// Возвращаемое значение:
//  Произвольный - Значение настройки.
//
Функция ЗначениеНастройки(Пользователь, БлокНавигации) Экспорт
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	НастройкиБлоковНавигации.ЗначениеНастройки КАК ЗначениеНастройки
		|ИЗ
		|	РегистрСведений.НастройкиБлоковНавигации КАК НастройкиБлоковНавигации
		|ГДЕ
		|	НастройкиБлоковНавигации.Пользователь = &Пользователь
		|	И НастройкиБлоковНавигации.БлокНавигации = &БлокНавигации");
	
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Запрос.УстановитьПараметр("БлокНавигации", БлокНавигации);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат ?(Выборка.Следующий(), Выборка.ЗначениеНастройки.Получить(), Неопределено);
	
КонецФункции

// Записывает настройки блока навигации.
Процедура ЗаписатьЗначениеНастройки(Пользователь, БлокНавигации, ЗначениеНастройки) Экспорт
	
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Пользователь.Установить(Пользователь);
	НаборЗаписей.Отбор.БлокНавигации.Установить(БлокНавигации);
	
	Если ЗначениеНастройки <> Неопределено Тогда
		СтрокаНабора = НаборЗаписей.Добавить();
		СтрокаНабора.Пользователь = Пользователь;
		СтрокаНабора.БлокНавигации = БлокНавигации;
		СтрокаНабора.ЗначениеНастройки = Новый ХранилищеЗначения(ЗначениеНастройки);
		СтрокаНабора.ПредставлениеНастройки = Строка(ЗначениеНастройки);
	КонецЕсли;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

// Возвращает структуру настройки блока навигации.
Функция СтруктураНастройкиБлокаНавигации() Экспорт
	
	СтруктураНастройкиБлокаНавигации = Новый Структура;
	СтруктураНастройкиБлокаНавигации.Вставить("Команды", Новый Соответствие);
	
	Возврат СтруктураНастройкиБлокаНавигации;
	
КонецФункции

// Возвращает структуру настройки команды блока навигации.
Функция СтруктураНастройкиКомандыБлокаНавигации() Экспорт
	
	СтруктураНастройкиБлокаНавигации = Новый Структура("Скрыть, СкрытьВЕще", Ложь, Ложь);
	
	Возврат СтруктураНастройкиБлокаНавигации;
	
КонецФункции

#КонецОбласти

#КонецЕсли
